<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of InstallPKG.</string>
	<key>Identifier</key>
	<string>com.github.morgrowe.download.InstallPKG</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>InstallPKG</string>
	</dict>
	<key>MinimumVersion</key>
    <string>1.1</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This set of recipes has been moved to homebysix-recipes. Please update your recipe list and overrides accordingly.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>http://lucid.systems/download/installpkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
